**step-1: Import required packages**

In [ ]:
a=10
b=20
c=a+b
c

In [26]:
import pandas as pd  # Dataframes operations
import numpy as np # math operations
import matplotlib.pyplot as plt # plotting
import seaborn as sns # plotting

**step-2: Create a Data-frame using a list**

In [27]:
names=['ramesh','suresh','mahesh']
age=[20,22,24]
pd.DataFrame(zip(names,age))

        0   1
0  ramesh  20
1  suresh  22
2  mahesh  24

**pd.DataFrame(data,index,column)**

- data=None

- index : index or array-like

- columns : index or array-like

In [28]:
names=['ramesh','suresh','mahesh']
age=[20,22,24]
# pd.DataFrame(data,index,columns)
pd.DataFrame(zip(names,age))

        0   1
0  ramesh  20
1  suresh  22
2  mahesh  24

**step-3: Add the columns names**

In [29]:
names=['ramesh','suresh','mahesh']
age=[20,22,24]
cols=['Names','Age']
# pd.DataFrame(data,index,columns)
pd.DataFrame(zip(names,age),columns=cols) # need to provide argument to avoid index

    Names  Age
0  ramesh   20
1  suresh   22
2  mahesh   24

**step-4: Add the index**

In [30]:
names=['ramesh','suresh','mahesh']
age=[20,22,24]
cols=['Names','Age']
idx=['A','B','C']
pd.DataFrame(zip(names,age),idx,cols)

    Names  Age
A  ramesh   20
B  suresh   22
C  mahesh   24

In [31]:
names=['ramesh','suresh','mahesh']
age=[20,22,24]
cols=['Names','Age']
idx=['A','B','C']
pd.DataFrame(zip(names,age),index=idx,columns=cols)

    Names  Age
A  ramesh   20
B  suresh   22
C  mahesh   24

**step-5: Create empty DataFrame and update the df**

In [32]:
# Above one we created dataframe with values directly
# Now first we will create empty df
# then we will add the values

df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [33]:
df['Names']
# if i run this column if any column preseent in this name that will display
# it will raise key error
# this means either you craeting a new column or update the existed columns

KeyError: 'Names'

In [34]:
names=['ramesh','suresh','mahesh']
df['Names']=names
df['Age']=[20,22,24]
df

    Names  Age
0  ramesh   20
1  suresh   22
2  mahesh   24

In [37]:
df=pd.DataFrame()
names=['ramesh','suresh','mahesh']
df['Names']=names
df['Age']=[20,22,24]
df

    Names  Age
0  ramesh   20
1  suresh   22
2  mahesh   24

In [38]:
df['Age']

0    20
1    22
2    24
Name: Age, dtype: int64

In [39]:
df['Age']=[30,32,34]  # updating the existed column in this name
df['age']=[100,200,300] # creating a new column in name 'age'
df['city']=['Hyd','Blr','Chennai']  # creating a new column in name 'city'
df

    Names  Age  age     city
0  ramesh   30  100      Hyd
1  suresh   32  200      Blr
2  mahesh   34  300  Chennai

**Notes**

- Python is case-sensitive

- 'Age' and 'age' consider as different names

- updated column values always should be as per the len DataFrame

- don't expect Null like sql, if we miss any value

In [40]:
df['Age']=[30,34] # required 3 values but you provide 2 values

ValueError: Length of values (2) does not match length of index (3)

**step-6: Drop the column**

- labels: 'IndexLabel | None' = None,

- axis: 'Axis' = 0,

- index:

- columns: 

- inplace: 'bool' = False,

In [41]:
df

    Names  Age  age     city
0  ramesh   30  100      Hyd
1  suresh   32  200      Blr
2  mahesh   34  300  Chennai

In [42]:
# what is our data-frame name: df
# i want to drop 'age' column
# what is the age column index
# 2 or [2]


df.drop(2)

    Names  Age  age city
0  ramesh   30  100  Hyd
1  suresh   32  200  Blr

In [45]:
df.drop([1,2])

    Names  Age  age city
0  ramesh   30  100  Hyd

In [43]:
df.drop(2,axis=0)

    Names  Age  age city
0  ramesh   30  100  Hyd
1  suresh   32  200  Blr

In [49]:
df

    Names  Age  age     city
0  ramesh   30  100      Hyd
1  suresh   32  200      Blr
2  mahesh   34  300  Chennai

In [44]:
df.drop(2,axis=1) # here you want to drop the column named as 'age'

KeyError: '[2] not found in axis'

In [53]:
df.drop(index=[2])  # it will drop the row in 2nd position

    Names  Age  age city
0  ramesh   30  100  Hyd
1  suresh   32  200  Blr

In [55]:
df.drop(index=2)  # it will drop the row in 2nd position

    Names  Age  age city
0  ramesh   30  100  Hyd
1  suresh   32  200  Blr

In [57]:
df.drop(columns='age')  # it will drop the column named as 'age'

    Names  Age     city
0  ramesh   30      Hyd
1  suresh   32      Blr
2  mahesh   34  Chennai

In [59]:
df.drop(columns=['age'])

    Names  Age     city
0  ramesh   30      Hyd
1  suresh   32      Blr
2  mahesh   34  Chennai

In [55]:
df.drop(2)

    Names city
0  ramesh  Hyd
1  suresh  Blr

In [63]:
df.columns

Index(['Names', 'Age', 'age', 'city'], dtype='object')

In [65]:
df.columns[2]

'age'

In [67]:
df.drop('age',axis=1)

    Names  Age     city
0  ramesh   30      Hyd
1  suresh   32      Blr
2  mahesh   34  Chennai

In [69]:
df.drop(labels=2)  # drop the 2nd row

    Names  Age  age city
0  ramesh   30  100  Hyd
1  suresh   32  200  Blr

In [71]:
df.drop(labels=[2])   # drop the 2nd row

    Names  Age  age city
0  ramesh   30  100  Hyd
1  suresh   32  200  Blr

In [73]:
df.drop('age') # python will check is there any row named as 'age' if yes it will drop or raise key error

KeyError: "['age'] not found in axis"

In [77]:
df.drop(columns='age')

    Names  Age     city
0  ramesh   30      Hyd
1  suresh   32      Blr
2  mahesh   34  Chennai

In [60]:
df

    Names     city
0  ramesh      Hyd
1  suresh      Blr
2  mahesh  Chennai

In [59]:
df.drop(df.columns[2], axis=1)   # drops the 3rd column (index starts from 0)

IndexError: index 2 is out of bounds for axis 0 with size 2

In [61]:
df.drop(['age','Age'],axis=1)

KeyError: "['age', 'Age'] not found in axis"

In [85]:
df.drop(columns=['age'],
        inplace=True)

In [87]:
df

    Names  Age     city
0  ramesh   30      Hyd
1  suresh   32      Blr
2  mahesh   34  Chennai

In [27]:
# assignment-1
# df.rename()

In [ ]:
# assignment-2
# df.shape
# df.size
# df.columns
# df.isnull()
# len(df)
# df.info
# df.drop_duplicates
# df.dtypes

# 24th June 2025

## Session-2

In [3]:
import pandas as pd
import

In [5]:
df=pd.DataFrame()
df['Names']=['ramesh','suresh','satish']
df['Age']=[20,22,24]
df['City']=['Hyd','Blr','Pune']
df

    Names  Age  City
0  ramesh   20   Hyd
1  suresh   22   Blr
2  satish   24  Pune

In [ ]:
df.drop(2)  # 2 means lebel is it roe or columns axis=0(by default)
df.drop(2,axis=0)
df.drop(index=2)
df.drop([1,2])
df.drop([1,2],axis=0)
df.drop(index=[1,2])

In [ ]:
df.drop('city',axis=1)
df.drop(['Names','city'])
df.drop(columns='City')
df.drop(columns=['Names','city'])

**step-7: rename the column and index**

- mapper: 'Renamer | None' = None,
- index: 'Renamer | None' = None,
- columns: 'Renamer | None' = None,
- axis: 'Axis | None' = None,
- copy: 'bool | None' = None,
- inplace: 'bool' = False,

**mapper means dictionary**

In [7]:
df.columns
dict1={'City':'city'}
# df.rename(dict1) # this mapper for index or column
df.rename(dict1,axis=1) # option-1

    Names  Age  city
0  ramesh   20   Hyd
1  suresh   22   Blr
2  satish   24  Pune

In [15]:
df.rename(columns=dict1) # option-2

    Names  Age  city
0  ramesh   20   Hyd
1  suresh   22   Blr
2  satish   24  Pune

In [9]:
df.columns=['A','B','C']
# in place also not required
df

        A   B     C
0  ramesh  20   Hyd
1  suresh  22   Blr
2  satish  24  Pune

In [11]:
df.index=['A','B','C']
df

        A   B     C
A  ramesh  20   Hyd
B  suresh  22   Blr
C  satish  24  Pune

In [16]:
# my code
dict2={0:'a',1:'b',2:'c'}
df=df.rename(dict2,axis=0)
df

    Names  Age  City
a  ramesh   20   Hyd
b  suresh   22   Blr
c  satish   24  Pune

In [18]:
df

    Names  Age  City
a  ramesh   20   Hyd
b  suresh   22   Blr
c  satish   24  Pune

In [13]:
df.columns=['Names','Age','City']
df.index=[0,1,2]
df

    Names  Age  City
0  ramesh   20   Hyd
1  suresh   22   Blr
2  satish   24  Pune

**step-8:append the row**

In [ ]:
- we need to use **loc**

- df.loc[<row numbers>,<column numbers>]

    - Example : df.loc[2,'City']

- Multiple row from multiple columns

    - Example : df.loc[[1,2],['Names','City']]

- df.loc[start:stop:step,<column names>]

    - Example : df.loc[0:3,'city']

In [36]:
df.loc[2,'City']

'Pune'

In [38]:
df.loc[[1,2],['City']]

   City
1   Blr
2  Pune

In [44]:
df.loc[[1,2],['Names','City']]

    Names  City
1  suresh   Blr
2  satish  Pune

In [48]:
df.loc[0:3,'City']

0     Hyd
1     Blr
2    Pune
Name: City, dtype: object

In [ ]:
df.loc[2]
df.loc[[2]]
df.loc[[1,2]]
df.loc[0:3]
df.loc[:]
df.loc[2,'City']
df.loc[2,['City']]
df.loc[[1,2],['Names','City']]
df.loc[:,'City']
df.loc[:,['City']]

In [54]:
df.loc[2]

Names    satish
Age          24
City       Pune
Name: 2, dtype: object

In [58]:
type(df.loc[2])

pandas.core.series.Series

In [56]:
df.loc[[2]]

    Names  Age  City
2  satish   24  Pune

In [15]:
type(df.loc[[2]]) # [[]] means always dataframe

pandas.core.frame.DataFrame

In [64]:
df.loc[[1,2]]

    Names  Age  City
1  suresh   22   Blr
2  satish   24  Pune

In [66]:
type(df.loc[[1,2]])

pandas.core.frame.DataFrame

In [68]:
df.loc[0:3]

    Names  Age  City
0  ramesh   20   Hyd
1  suresh   22   Blr
2  satish   24  Pune

In [70]:
type(df.loc[0:3])

pandas.core.frame.DataFrame

In [74]:
type(df.loc[:])

pandas.core.frame.DataFrame

In [76]:
df.loc[2,'City']

'Pune'

In [78]:
type(df.loc[2,'City'])

str

In [80]:
df.loc[2,['City']]

City    Pune
Name: 2, dtype: object

In [82]:
type(df.loc[2,['City']])

pandas.core.series.Series

In [84]:
df.loc[[2],['City']]

   City
2  Pune

In [86]:
type(df.loc[[2],['City']])

pandas.core.frame.DataFrame

In [88]:
df.loc[[1,2],['Names','City']]

    Names  City
1  suresh   Blr
2  satish  Pune

In [90]:
type(df.loc[[1,2],['Names','City']])

pandas.core.frame.DataFrame

In [94]:
df.loc[:,'City']

0     Hyd
1     Blr
2    Pune
Name: City, dtype: object

In [96]:
type(df.loc[:,'City'])

pandas.core.series.Series

In [98]:
df.loc[:,['City']]

   City
0   Hyd
1   Blr
2  Pune

In [100]:
type(df.loc[:,['City']])

pandas.core.frame.DataFrame

In [ ]:
df.iloc[2]
df.iloc[[2]]
df.iloc[[1,2]]
df.iloc[0:3]
df.iloc[:]
df.iloc[2,2]
df.iloc[2,[2]]
df.iloc[[1,2],[0,2]]
df.iloc[:,2]
df.iloc[:,[2]]

In [17]:
df

    Names  Age  City
0  ramesh   20   Hyd
1  suresh   22   Blr
2  satish   24  Pune

In [19]:
df.iloc[2]

Names    satish
Age          24
City       Pune
Name: 2, dtype: object

In [106]:
type(df.iloc[2])

pandas.core.series.Series

In [108]:
df.iloc[[2]]

    Names  Age  City
2  satish   24  Pune

In [110]:
type(df.iloc[[2]])

pandas.core.frame.DataFrame

In [112]:
df.iloc[[1,2]]

    Names  Age  City
1  suresh   22   Blr
2  satish   24  Pune

In [114]:
type(df.iloc[[1,2]])

pandas.core.frame.DataFrame

In [116]:
df.iloc[0:3] # why data frame

    Names  Age  City
0  ramesh   20   Hyd
1  suresh   22   Blr
2  satish   24  Pune

In [118]:
type(df.iloc[0:3])

pandas.core.frame.DataFrame

In [21]:
df

    Names  Age  City
0  ramesh   20   Hyd
1  suresh   22   Blr
2  satish   24  Pune

In [23]:
df.iloc[:] # why data frame

    Names  Age  City
0  ramesh   20   Hyd
1  suresh   22   Blr
2  satish   24  Pune

In [122]:
type(df.iloc[:])

pandas.core.frame.DataFrame

In [124]:
df.iloc[2,2]

'Pune'

In [126]:
type(df.iloc[2,2])

str

In [128]:
df.iloc[2,[2]]

City    Pune
Name: 2, dtype: object

In [130]:
type(df.iloc[2,[2]])

pandas.core.series.Series

In [132]:
df.iloc[[1,2],[0,2]]

    Names  City
1  suresh   Blr
2  satish  Pune

In [134]:
type(df.iloc[[1,2],[0,2]])

pandas.core.frame.DataFrame

In [144]:
df.iloc[:,2] #why series

0     Hyd
1     Blr
2    Pune
Name: City, dtype: object

In [138]:
type(df.iloc[:,2])

pandas.core.series.Series

In [140]:
df.iloc[:,[2]]

   City
0   Hyd
1   Blr
2  Pune

In [142]:
type(df.iloc[:,[2]])

pandas.core.frame.DataFrame

**step-9:Save the DataFrame**

- where i want to save

- on what extension i want to save

- on what extensions: .csv,.xlsx

In [25]:
path1=r"D:\Generative ai\employess.csv"
path2=r'employees.csv'
path3=r"D:\Generative ai\employess.xlsx"
path4=r'employees.xlsx'

df.to_csv(path1)
df.to_csv(path2)
df.to_excel(path3)
df.to_excel(path4)

**Step-10: Read the DataFrame**

In [28]:
pd.read_csv(path1)

   Unnamed: 0   Names  Age  City
0           0  ramesh   20   Hyd
1           1  suresh   22   Blr
2           2  satish   24  Pune

In [30]:
pd.read_excel(path3)

   Unnamed: 0   Names  Age  City
0           0  ramesh   20   Hyd
1           1  suresh   22   Blr
2           2  satish   24  Pune

In [32]:
df

    Names  Age  City
0  ramesh   20   Hyd
1  suresh   22   Blr
2  satish   24  Pune

**remove indexing from files**

In [35]:
path1=r"D:\Generative ai\employess.csv"
path2=r'employees.csv'
path3=r"D:\Generative ai\employess.xlsx"
path4=r'employees.xlsx'

df.to_csv(path1,index=False)
df.to_csv(path2,index=False)
df.to_excel(path3,index=False)
df.to_excel(path4,index=False)

In [37]:
pd.read_excel(path3)

    Names  Age  City
0  ramesh   20   Hyd
1  suresh   22   Blr
2  satish   24  Pune

# 25th june 2025

In [36]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [12]:
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [30]:
visa_path=r"D:\DataSets\Visadataset.csv"
df.to_csv(visa_path)

In [24]:
pd.read_csv(visa_path)

Empty DataFrame
Columns: [Unnamed: 0]
Index: []